---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRamp
source: html/626dc1cc-3076-4769-3f45-e8f5452486c7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRamp Property

Riser line must be a straight line for Ramps.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotALineRiserRamp { get; }
```